#include "main.h"

/**********************************************************************************
内存池32字节对齐
**********************************************************************************/
__align(32) u8 mem1base[MEM1_MAX_SIZE];													//内部SRAM
__align(32)	u8 mem2base[MEM2_MAX_SIZE] __attribute__((at(0XC01F4000)));				//外部SRAM内存池，前面2M给LTDC
																					//用了（1280*800*2）
__align(32)	u8 mem3base[MEM3_MAX_SIZE]	__attribute__((at(0X1000000)));				//内部CCM内存池

/*******************************************************************************************
内存管理表，内存MAP
*******************************************************************************************/
u32 mem1mapbase[MEM1_ALLOC_TABLE_SIZE];														//内部SRAM
u32 mem2mapbase[MEM2_ALLOC_TABLE_SIZE] __attribute__((at(0XC01F4000+MEM2_MAX_SIZE)));		//外部SRAM内存池MAP	
u32 mem3mapbase[MEM3_ALLOC_TABLE_SIZE] __attribute__((at(0X10000000+MEM3_MAX_SIZE)));		//内部CCM内存池MAP

/********************************************************************************************
内存管理参数
********************************************************************************************/
const u32 memtblsize[SRAMBANK]={MEM1_ALLOC_TABLE_SIZE,MEM2_ALLOC_TABLE_SIZE,MEM3_ALLOC_TABLE_SIZE};		//内存表大小
const u32 memblksize[SRAMBANK]={MEM1_BLOCK_SIZE,MEM2_BLOCK_SIZE,MEM3_BLOCK_SIZE};						//内存分块大小
const u32 memsize[SRAMBANK]={MEM1_MAX_SIZE,MEM2_MAX_SIZE,MEM3_MAX_SIZE};							//内存总大小

/************************************************************************************************
内存管理控制器
************************************************************************************************/
struct_m_malloc_dev mallco_dev={
									My_Mem_Init,								//内存初始化
									my_mem_perused,								//内存使用率
									mem1base,mem2base,mem3base,					//内存池
									mem1mapbase,mem2mapbase,mem3mapbase,		//内存管理状态表
									0,0,0,										//内存管理未就绪
								};
/*********************************************************************************************
复制内存
*des:目标地址
*src:源地址
n：需要复制的内存长度（字节为单位）
*********************************************************************************************/
void mymemcpy(void * des, void * src, u32 n)
{
	u8 *xdes=des;
	u8 *xsrc=src;
	while(n--)
		*xdes++=*xsrc++;
}
/*********************************************************************************************
设置内存
*s：内存首地址
c：要设置的值
count:需要设置的内存大小（单位字节）
*********************************************************************************************/
void mymemset(void * s, u8 c, u32 count)
{
	u8 *xs=s;
	while(count--)
		*xs++=c;
}


